# coding: utf-8

import numpy as np
import matplotlib.pyplot as plt
import random
from wordcloud import WordCloud, STOPWORDS
from PIL import Image
import glob
import jieba

def word_plot(words=None, save_file="test.png"):
    if words is None:
        words = "这只是一个小的中文测试"
    words = jieba.cut(words)
    words = list(words)

    filenames = glob.glob('./pic/'+ "*.png")
    filename = random.choice(filenames)
    # print(filenames)
    mask = np.array(Image.open(filename))
    stopword = set(STOPWORDS)

    fonts = glob.glob('./fonts/' + "*.ttf")
    font = random.choice(fonts)
    # print(font)
    # fonts = "/Library/Fonts/Songti.ttc"
    wc = WordCloud(background_color='white', font_path=font, max_words=200, mask=mask)
    # wc = WordCloud(background_color='white', mask=mask, max_words=200)
    # print(words)
    # print(" ".join(words))
    wc.generate(" ".join(words))
    wc.to_file(save_file)
    # plt.imshow(wc)
    # # plt.show()
    # wc = wc.to_image()

    # return HttpResponse(wc, content_type="image/png")
   
if __name__ == "__main__":
    word_plot()
# words1 = [
# ['从今以后', '从此', '从此往后','自此以后', '你俩','咱','那咱','理会','去理','怎么','从此以后','咱俩','搭理','谁', '从此以后', '咱俩', '谁', '也不', '搭理', '谁','从此以后', '咱俩', '谁', '也不', '搭理', '谁'],
# ['从今天起','自此','我玉凌羽','以后','从此往后','自此以后', '你俩','吱声','怎么','从此以后','咱俩','为什么','哪','从此以后', '咱俩', '谁', '也不', '搭理', '谁','从此以后', '咱俩', '谁', '也不', '搭理', '谁'],
# ['从那以后','这辈子','以后','从此往后','永生永世','永世','我俩','咋们','理他','搭腔' ,'谁人','何人','去理','再理','从此以后', '咱俩', '谁', '也不', '搭理', '谁'],
# ['自此以后','一朝','不久便','终得','姬','夕','洛','不语','不作声','吱声','怎么','谁人','何人','去理','再理','相', '自此以后', '君相不言', '自此以后', '君相不言'],
# ['自此以后','一朝','不久便','终得','就此','归隐','苍','洛','不置一词','未言','不答','谁人','何人','去理','再理', '自此以后', '君相不言', '自此以后', '君相不言', '自此以后', '君相不言'],
# ['断去','再断','你断','断上','思忖','忖度','思酌','过来','我来','上门来','她','自己','自己','不答','谁人','何人', '从今以往', '勿复相思'],
# ['穆','尹','黎','要断','就断','思忖','忖度','思酌','过来','我来','上门来','她','自己','自己','不答','谁人','何人', '从今以往', '勿复相思', '从今以往', '勿复相思'],
# ['穆','尹','黎','要断','就断','思忖','忖度','思酌','过来','我来','未言','不答','谁人','何人','去理','何人', '从今以往', '勿复相思', '从今以往', '勿复相思', '从今以往', '勿复相思'],
# ['还断','先断','思忖','权衡','踌躇','慕','殷','郁','我们','自己','他们','我呢','你们','了','何人','去理','何人','去理', '我', '断', '不思量', '你', '莫', '思量', '我'],
# ['断去','再断','要断','就断','思忖','殷','郁','我们','自己','他们','忖度','盘算','斟酌','上门来','她','自己','自己', '我', '断', '不思量', '你', '莫', '思量', '我', '我', '断', '不思量', '你', '莫', '思量', '我']
# ]
# words2 = [
# ['秋天','深秋','盛夏','早春','雨季','出去','来本','上门来','太阳光','红日','烈日当空','暖烘烘','清凉','暖融融','山风','柔风','轻风','细风','极其','特别','舒爽','塌实', '春天', '来了', '太阳', '很暖', '还有', '微风拂面', '非常', '舒服', '春天', '来了', '太阳', '很暖', '还有', '微风拂面', '非常', '舒服'],
# ['秋天','春暖花开','盛夏','草长莺飞','雨季','出去','来本','上门来','太阳光','红日','清凉','暖烘烘','清凉','暖融融','海风','柔风','轻风','细风','极其','异常','舒爽','塌实', '春天', '来了', '太阳', '很暖', '还有', '微风拂面', '非常', '舒服', '春来', '甚暖', '风', '拂面', '甚快'
# ],
# ['菊','春暖花开','春来','草长莺飞','见春','顿凉','来本','顿安','骤凉','红日','清凉','暖烘烘','清凉','暖融融','海风','柔风','轻风','但风','极其','微徐','异常','吹拂','塌实',  '春天', '来了', '太阳', '很暖', '还有', '微风拂面', '非常', '舒服',  '春来', '甚暖', '风', '拂面', '甚快'],
# ['春来','春暖花开','见春','草长莺飞','春想','顿凉','来本','顿安','骤凉','红日','清凉','极暖','清凉','暖融融','海风','柔风','轻风','但风','极其','微徐','抚面','吹拂','吹拂',  '春来', '甚暖', '风', '拂面', '甚快',  '春来', '甚暖', '风', '拂面', '甚快', '春天', '来了', '微风', '拂面', '甚快'],
# ['春来','春暖花开','见春','听薇','春想','忽暖','来本','顿安','骤凉','风所','清凉','极暖','清凉','暖融融','海风','柔风','轻风','但风','极其','微徐','抚面','习习','吹拂',  '春来', '甚暖', '风', '拂面', '甚快',  '春来', '甚暖', '风', '拂面', '甚快', '春天', '来了', '微风', '拂面', '甚快'],
# ['春来','快极','见春','听薇','春是','忽暖','来本','顿安','忧上','风所','清凉','云','清凉','暖融融','海风','柔风','轻风','但风','极其','微拂','甜蜜','习习','憧憬',  '春来', '甚暖', '风', '拂面', '甚快',  '春来', '甚暖', '风', '拂面', '甚快',  '春来', '甚暖', '风', '拂面', '甚快'],
# ['春来','晴晴','见春','乔乔','春是','当作','来本','贡归','忧上','柔柔','清凉','云','清凉','暖融融','海风','甩','忽而','但风','雪销','寒姿','甜蜜','习习','海阔',  '春来', '甚暖', '风', '拂面', '甚快',  '春来', '甚暖', '风', '拂面', '甚快',  '春来', '甚暖', '风', '拂面', '甚快',  '春来', '甚暖', '风', '拂面', '甚快'],
# ['冉冉','晴晴','见春','乔乔','小米','当作','来本','贡归','忧上','柔柔','是当','云','清凉','暖融融','海风','甩','忽而','但风','雪销','寒姿','甜蜜','习习','海阔',  '春来', '甚暖', '风', '拂面', '甚快',  '春来', '甚暖', '风', '拂面', '甚快',  '春来', '甚暖', '风', '拂面', '甚快', '暖暖当迟日', '微微扇好风', '暖暖当迟日', '微微扇好风'],
# ['冉冉','晴晴','见春','乔乔','小米','当作','来本','顿安','骤凉','红日','清凉','暖烘烘','清凉','暖融融','海风','柔风','轻风''清凉','暖融融','海风','吹拂','塌实','春来', '甚暖', '风', '拂面', '甚快',  '暖暖当迟日', '微微扇好风', '暖暖当迟日', '微微扇好风', '暖暖当迟日', '微微扇好风'],
# ['安安','可可','乐乐','当孤王', '当大','贡归','倚醉','春浓','淑气','春风花草香','随即','蓦地','微', '一巴掌','前扇','韶华休笑本无根','道之云远','银汉','微徐','抚面', '暖暖当迟日', '微微扇好风', '暖暖当迟日', '微微扇好风', '暖暖当迟日', '微微扇好风',]
# ]

# i = 0
# for words in words1:

#     word_plot(words=words, save_file="1"+str(i)+".png")
#     i += 1

# i = 0
# for words in words2:
#     word_plot(words=words, save_file="2"+str(i)+".png")
#     i += 1

